Repository: TeX-Live/xetex
Catalog: TeX/libs/freetype/po/*.po
Languages: cs

source: Welcome to the translation of the Freetype v.1 library! This message is not really part of the library (it is bracketed by #if 0 / #endif), but is really intended to be the first one in the .po file, and the first one that a new translator should see, to give hints. First, while this .po might seems big, the real interesting part of it is only the messages in this file, lib/extend/ftxerr18.c. The other messages are part of the demonstration programs, and are more intended to help grasping how to use i18n with the Freetype library. So the real work is the about 65 first ones. Unfortunately they are the harder ones! A difficulty is that there are some specialized vocabulary, about ``faces'', ``glyph'' and similar things. These are typographical things, and this should be researched before attempting to translate the whole thing. A quick look across the TrueType documentation might help to understand many things, too. Best wiches for your translation! Antoine Leca - 2002-11-08
cs: (Read)

source: Successful function call, no error.
cs: Úspì¹né volání funkce, ¾ádná chyba.

source: Invalid face handle.
cs: Neplatný manipulátor písma.

source: Invalid instance handle.
cs: Neplatný manipulátor instance.

source: Invalid glyph handle.
cs: Neplatný manipulátor litery.

source: Invalid charmap handle.
cs: Neplatný manipulátor znakové mapy.

source: Invalid result address.
cs: Neplatná adresa výsledku.

source: Invalid glyph index.
cs: Neplatný index litery.

source: Invalid argument.
cs: Neplatný argument.

source: Could not open file.
cs: Nelze otevøít soubor.

source: File is not a TrueType collection.
cs: Soubor není kolekce písem TrueType.

source: Mandatory table missing.
cs: Nìkterá z povinných tabulek chybí.

source: Invalid horizontal metrics (hmtx table broken).
cs: Neplatná horizontální metrika (tabulka HMTX po¹kozena).

source: Invalid charmap format.
cs: Neplatný formát znakové mapy.

source: Invalid ppem value.
cs: Neplatné rozmìry liter (ppem).

source: Invalid vertical metrics (vmtx table broken).
cs: Neplatná vertikální metrika (tabulka VMTX po¹kozena).

source: Invalid file format.
cs: Neplatný formát souboru.

source: Invalid engine.
cs: Neplatná globální data knihovny.

source: Too many extensions.
cs: Pøíli¹ mnoho roz¹íøení.

source: Extensions unsupported.
cs: Roz¹íøení není podporováno.

source: Invalid extension id.
cs: Neplatný identifikátor roz¹íøení.

source: No vertical data in font.
cs: V písmu nejsou obsa¾ena ¾ádná vertikální data.

source: Maximum Profile (maxp) table missing.
cs: Chybìjící tabulka maximálních hodnot (MAXP).

source: Font Header (head) table missing.
cs: Chybìjící tabulka hlavièky písma (HEAD).

source: Horizontal Header (hhea) table missing.
cs: Chybìjící tabulka horizontální hlavièky (HHEA).

source: Index to Location (loca) table missing.
cs: Chybìjící tabulka adres liter (LOCA).

source: Naming (name) table missing.
cs: Chybìjící tabulka jmen (NAME).

source: Character to Glyph Index Mapping (cmap) tables missing.
cs: Chybìjící tabulky znakových map (CMAP).

source: Horizontal Metrics (hmtx) table missing.
cs: Chybìjící tabulka horizontálních metrik (HTMX).

source: OS/2 table missing.
cs: Chybìjící tabulka OS/2.

source: PostScript (post) table missing.
cs: Chybìjící tabulka dat pro PostScript (POST).

source: Glyph (glyf) table missing.
cs: Chybìjící tabulka liter (GLYF).

source: Out of memory.
cs: Nedostatek pamìti.

source: Invalid file offset.
cs: Neplatná adresa v souboru.

source: Invalid file read.
cs: Neplatné ètení ze souboru.

source: Invalid frame access.
cs: Neplatný pøístup k úseku souboru.

source: Too many points.
cs: Pøíli¹ mnoho bodù.

source: Too many contours.
cs: Pøíli¹ mnoho kontur.

source: Invalid composite glyph.
cs: Neplatná kompozitní litera.

source: Too many instructions.
cs: Pøíli¹ mnoho instrukcí.

source: Too many function definitions (FDEF).
cs: Pøíli¹ mnoho definic funkcí (FDEF).

source: Invalid opcode.
cs: Neplatný kód operace.

source: Too few arguments.
cs: Pøíli¹ málo argumentù.

source: Stack overflow.
cs: Pøeteèení zásobníku.

source: Code overflow.
cs: Pøeteèení oblasti instrukcí.

source: Bad argument.
cs: ©patný argument.

source: Divide by zero.
cs: Dìlení nulou.

source: Storage overflow.
cs: Pøeteèení oblasti pro ukládání dat.

source: Control Value (cvt) table overflow.
cs: Pøeteèení tabulky øídících hodnot (CVT).

source: Invalid reference.
cs: Neplatný odkaz.

source: Invalid distance.
cs: Neplatná vzdálenost.

source: Interpolate twilight points.
cs: Interpolace mezi body v "soumraèné zónì".

source: `DEBUG' opcode found.
cs: Ladící operace.

source: `ENDF' in byte-code stream.
cs: Operace ENDF nalezena na ¹patném místì.

source: Out of code ranges.
cs: Mimo oblasti instrukcí.

source: Nested function definitions.
cs: Vnoøené definice funkcí.

source: Invalid code range.
cs: Neplatná oblast instrukcí.

source: Invalid displacement.
cs: Neplatné posunutí.

source: Endless loop encountered while executing instructions.
cs: Do¹lo k zacyklení bìhem vykonávání instrukcí.

source: Nested frame access.
cs: Vnoøené pøístupy k úseku souboru.

source: Invalid cache list.
cs: Neplatný seznam vyrovnávací pamìti.

source: Could not find context.
cs: Nelze najít kontext.

source: Unlisted object.
cs: Objekt není v seznamu.

source: Raster pool overflow.
cs: Pøeteèení pamìti rasterizéru.

source: Raster: negative height encountered.
cs: Rasterizér: záporná vý¹ka.

source: Raster: invalid value.
cs: Rasterizér: neplatná hodnota.

source: Raster not initialized.
cs: Rasterizér není incializován.

source: Invalid kerning (kern) table format.
cs: Neplatný formát tabulky kernù (KERN).

source: Invalid kerning (kern) table.
cs: Neplatná tabulka kernù (KERN).

source: Invalid PostScript (post) table format.
cs: Neplatný formát tabulky PostScript (POST).

source: Invalid PostScript (post) table.
cs: Neplatná tabulka PostScript (POST).

source: Invalid TrueType Open subtable format.
cs: Neplatný formát podtabulky TrueType Open.

source: Invalid TrueType Open subtable.
cs: Neplatná podtabulka TrueType Open.

source: Glyph(s) not covered by lookup.
cs: Jedna èi více liter bìhem prohledávání nenalezena.

source: Too many nested context substitutions.
cs: Pøíli¹ mnoho vnoøených kontextových substitucí.

source: No MM (Adobe MultipleMaster) interpreter available.
cs: ®ádný interpreter MM (Adobe MultipleMaster) není k dispozici.

source: Invalid glyph substitution (GSUB) table format.
cs: Neplatný formát tabulky substitucí liter (GSUB).

source: Invalid glyph substitution (GSUB) table.
cs: Neplatná tabulka substitucí liter (GSUB).

source: Invalid glyph positioning (GPOS) table format.
cs: Neplatný formát tabulky umís»ování liter (GPOS).

source: Invalid glyph positioning (GPOS) table.
cs: Neplatná tabulka umís»ování liter (GPOS).

source: Invalid glyph definition (GDEF) table format.
cs: Neplatný formát tabulky definic liter (GDEF).

source: Invalid glyph definition (GDEF) table.
cs: Neplatná tabulka definic liter (GDEF).

source: Invalid Error Number.
cs: Neznámý kód chyby.

source: fterror: test TT_ErrToString18 functionality
cs: fterror: test funkce TT_ErrToString18

source: with an optional numerical argument, dumps the associated message.
cs: pøi zadání èíselného argumentu vypí¹e odpovídající hlá¹ení.

source: Start of fterror.
cs: Zaèátek fterror.

source: End of fterror.
cs: Konec fterror.

source: Freetype error code 0x%04lX (%lu): %s
cs: Chybové hlá¹ení FreeType 0x%04lX (%lu): %s

source: Could not create glyph container.
cs: Nelze vytvoøit kontejner liter.

source: Could not create instance.
cs: Nelze vytvoøit instanci.

source: Could not create second instance.
cs: Nelze vytvoøit druhou instanci.

source: Memory footprint statistics:
cs: Statistika pamì»ových nárokù:

source: face object
cs: objekt písma

source: glyph object
cs: objekt litery

source: instance object
cs: objekt instance

source: exec. context object
cs: objekt provádìcího kontextu

source: total memory usage
cs: celková spotøeba pamìti

source: FreeType error message: %s
cs: Chybové hlá¹ení FreeType: %s

source: font name table entries
cs: polo¾ky v tabulce jmen

source: PostScript name: %s
cs: PostScriptové jméno: %s

source: character map encodings
cs: kódování map znakù

source: The file doesn't seem to have any encoding table.
cs: Soubor zøejmì neobsahuje ¾ádnou mapu znakù.

source: There are %hu encodings:
cs: %hu kódování:

source: encoding %2u:
cs: kódování %2u:

source: Unknown value %hu
cs: Neznámá hodnota %hu

source: Unknown
cs: Neznámé

source: ftxcmap test
cs: test roz¹íøení ftxcmap

source: encoding %2u:
cs: kódování %2u:

source: first: glyph index %hu, character code 0x%lx
cs: první: index litery %hu, kód znaku 0x%lx

source: next: glyph index %hu, character code 0x%lx
cs: dal¹í: index litery %hu, kód znaku 0x%lx

source: last: glyph index %hu, character code 0x%lx
cs: poslední: index litery %hu, kód znaku 0x%lx

source: Error while retrieving embedded bitmaps table.
cs: Chyba bìhem naèítání tabulky vlo¾ených bitmap.

source: embedded bitmap table
cs: tabulka vlo¾ených bitmap

source: version of embedded bitmap table: 0x%lx
cs: verze tabulky vlo¾ených bitmap: 0x%lx

source: number of embedded bitmap strikes: %lu
cs: poèet blokù vlo¾ených bitmap: %lu

source: bitmap strike %hu/%lu:
cs: blok vlo¾ených bitmap %hu/%lu:

source: %hux%hu pixels, %hu-bit depth, glyphs [%hu..%hu]
cs: %hux%hu pixelù, bitová hloubka %hu, litery [%hu..%hu]

source: range format (%hu:%hu) glyphs %hu..%hu
cs: úsek formátu (%hu:%hu) litery %hu..%hu

source: Error while loading GSUB table.
cs: Chyba bìhem naèítání tabulky GSUB.

source: GSUB table
cs: tabulka GSUB

source: Error while querying GSUB script list.
cs: Chyba bìhem prohledávání seznamu GSUB skriptù.

source: Error while selecting GSUB script `%4.4s'.
cs: Chyba pøi pokusu vybrat GSUB skript "%4.4s".

source: script `%4.4s' (index %hu):
cs: skript "%4.4s" (index %hu):

source: Error while querying GSUB default language system for script `%4.4s'.
cs: Chyba bìhem zkoumání bì¾ného GSUB jazykového systému pro skript "%4.4s".

source: default language system:
cs: bì¾ný jazykový systém:

source: Error while selecting GSUB feature `%4.4s' for default language system of script `%4.4s'.
cs: Chyba pøi výbìru GSUB vlastnosti "%4.4s" pro bì¾ný jazykový systém skriptu "%4.4s".

source: feature `%4.4s' (index %hu; lookup
cs: vlastnost "%4.4s" (index %hu; vyhledávání

source: Error while querying GSUB language list for script `%4.4s'.
cs: Chyba bìhem zkoumání GSUB seznamu jazykù pro skript "%4.4s".

source: Error while selecting GSUB language `%4.4s' for script `%4.4s'.
cs: Chyba bìhem výbìru GSUB jazyka "%4.4s" pro skript "%4.4s".

source: language `%4.4s' (index %hu):
cs: jazyk "%4.4s" (index %hu):

source: required feature index %hu (lookup
cs: po¾adovaná vlastnost (index %hu; vyhledávání

source: Error while querying GSUB feature list for script `%4.4s', language `%4.4s'.
cs: Chyba bìhem zkoumání seznamu GSUB vlastností pro skript "%4.4s", jazyk "%4.4s".

source: Error while selecting GSUB feature `%4.4s' for script `%4.4s', language `%4.4s'.
cs: Chyba bìhem výbìru GSUB vlastnosti "%4.4s" pro skript "%4.4s", jazyk "%4.4s".

source: Lookups:
cs: Vyhledávací údaje:

source: %hu: type %hu, flag 0x%x
cs: %hu: typ %hu, pøíznaky 0x%x

source: Error while loading GPOS table.
cs: Chyba bìhem naèítání tabulky GPOS.

source: GPOS table
cs: tabulka GPOS

source: Error while querying GPOS script list.
cs: Chyba bìhem prohledávání seznamu GPOS skriptù.

source: Error while selecting GPOS script `%4.4s'.
cs: Chyba pøi pokusu vybrat GPOS skript "%4.4s".

source: Error while querying GPOS default language system for script `%4.4s'.
cs: Chyba bìhem zkoumání bì¾ného GPOS jazykového systému pro skript "%4.4s".

source: Error while selecting GPOS feature `%4.4s' for default language system of script `%4.4s'.
cs: Chyba pøi výbìru GPOS vlastnosti "%4.4s" pro bì¾ný jazykový systém skriptu "%4.4s".

source: Error while querying GPOS language list for script `%4.4s'.
cs: Chyba bìhem zkoumání GPOS seznamu jazykù pro skript "%4.4s".

source: Error while selecting GPOS language `%4.4s' for script `%4.4s'.
cs: Chyba bìhem výbìru GPOS jazyka "%4.4s" pro skript "%4.4s".

source: Error while querying GPOS feature list for script `%4.4s', language `%4.4s'.
cs: Chyba bìhem zkoumání seznamu GPOS vlastností pro skript "%4.4s", jazyk "%4.4s".

source: Error while selecting GPOS feature `%4.4s' for script `%4.4s', language `%4.4s'.
cs: Chyba bìhem výbìru GPOS vlastnosti "%4.4s" pro skript "%4.4s", jazyk "%4.4s".

source: ftdump: Simple TrueType Dumper -- part of the FreeType project
cs: ftdump: jednoduchý výpis obsahu písma TrueType -- souèást projektu FreeType

source: Usage: %s fontname[.ttf|.ttc]
cs: Pou¾ití: %s název-písma[.ttf|.ttc]

source: Error while initializing engine.
cs: Chyba bìhem inicializace knihovny.

source: Error while initializing embedded bitmap extension.
cs: Chyba bìhem inicializace roz¹íøení pro vlo¾ené bitmapy.

source: Error while initializing GSUB extension.
cs: Chyba bìhem inicializace roz¹íøení pro substituce liter (GSUB).

source: Error while initializing GPOS extension.
cs: Chyba bìhem inicializace roz¹íøení pro umís»ování liter (GPOS).

source: Could not find or open %s.
cs: Nelze nalézt nebo otevøít soubor %s.

source: Error while opening %s.
cs: Chyba bìhem otevírání souboru %s.

source: ftlint: Simple TrueType instruction tester -- part of the FreeType project
cs: ftlint: test instrukcí písma TrueType -- souèást projektu FreeType

source: Usage: %s ppem fontname[.ttf|.ttc] [fontname2..]
cs: Pou¾ití: %s ppem název-písma[.ttf|.ttc] [název-dal¹ího-písma...]

source: Could not set point size to %d.
cs: Nelze nastavit velikost písma na %d bodù.

source: Error with
cs: Výskyt chyb

source: glyph %4u: %s
cs: litera %4d: %s

source: 1 fail.
cs: poèet chyb: 1

source: %d fails.
cs: poèet chyb: %d

source: ftmetric: Simple TTF metrics/glyph dumper -- part of the FreeType project
cs: ftmetric: výpis metrik písma TrueType -- souèást projektu FreeType

source: Usage: %s [options below] point fontname[.ttf|.ttc] -B show sbit's metrics (default: none) -c C use C'th font index of TrueType collection (default: 0) -i index glyph index (default: 0) -r R use resolution R dpi (default: 72)
cs: Pou¾ití: %s [volby (viz ní¾e)] bodová-velikost název-písma[.ttf|.ttc] -B zobraz rozmìry bitmapy (std: nezobrazuj) -c C pou¾ij písmo indexu C z kolekce písem (std: 0) -i index index litery (std: 0) -r R rozli¹ení R bodù na palec (std: 72 dpi)

source: There are %d fonts in this collection.
cs: Poèet písem v kolekci: %d.

source: There is no collection with index %d in this font file.
cs: V kolekci není ¾ádné písmo s indexem %d.

source: There is no embedded bitmap data in the font.
cs: V souboru písma nejsou vlo¾eny ¾ádné bitmapy.

source: Could not set device resolutions.
cs: Nelze nastavit rozli¹ení zaøízení.

source: Could not reset instance.
cs: Nelze inicializovat instanci.

source: Instance metrics: ppemX %d, ppemY %d
cs: Rozmìry instance: ppemX %d, ppemY %d

source: Could not allocate glyph bitmap container.
cs: Nelze vytvoøit kontejner vlo¾ených bitmap.

source: Can't load bitmap for glyph %d.
cs: Nelze naèíst bitmapu pro literu %d.

source: Outline's metrics
cs: Rozmìry obrysu

source: Outline glyph
cs: Obrys litery

source: ftsbit: Simple TrueType `sbit' dumper -- part of the FreeType project
cs: ftsbit: výpis bitmap vlo¾ených do písma TrueType -- souèást projektu FreeType

source: Usage: %s ppem fontname[.ttf|.ttc] glyph_index [glyph_index2..]
cs: Pou¾ití: %s ppem název-písma[.ttf|.ttc] index-litery [index-dal¹í-litery...]

source: Could not find embedded bitmaps in this font.
cs: V souboru písma nelze nalézt ¾ádné vlo¾ené bitmapy.

source: Error while loading embedded bitmaps.
cs: Chyba bìhem naèítání vlo¾ených bitmap.

source: no bitmap for glyph %d.
cs: litera %d nemá ¾ádnou vlo¾enou bitmapu.

source: glyph index %d = %dx%d pixels,
cs: litera %d = %dx%d pixelù,

source: advance = %ld, minBearing = [%ld,%ld]
cs: posun = %ld, minBearing = [%ld,%ld]
